jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
#include <Arduino.h>
#include <esp32_smartdisplay.h>

// ADC Objects
#include "ADS1X15.h"
ADS1115 ADS(0x48);

// io expander Objects
//#include <pcf8574.h>
//PCF8574 ex1(0x27);


// LVGL Objects
static lv_obj_t *Acquisition_label;
static lv_obj_t *loadChart;
static lv_chart_series_t *load_ser;

static lv_obj_t *posChart;
static lv_chart_series_t *pos_ser;

static lv_obj_t *label_box_load;
static lv_obj_t *label_box_pos;

/* ====================== DEEP SLEEP CONFIG ======================== */
#define uS_TO_S_FACTOR 1000000
int TIME_TO_SLEEP = 300; // 5 minutes sleep

RTC_DATA_ATTR int idT = 0;

/* ====================== MQTT CONFIG ======================== */
#include <WiFi.h>

const char *ssid = "Hora De Estudiar-2.4GHz";
const char *password = "c0l053n5353:20";

WiFiClient client;
#include <PubSubClient.h>

PubSubClient mqtt(client);

// const char *broker = "broker.emqx.io";
const char *broker = "broker.hivemq.com";
const int mqtt_port = 1883;
const char *mqtt_id = "gle_client_234";
const char *mqtt_user = "gle";
const char *mqtt_pass = "glettxx";

String topicSubscribe = "jphOandG/";

// const char *topicSubscribe = "oilAIOT/field/Well01";
const char *topicPublish = "jphOandG/data";

/* ========================== TOOLS ========================== */
#include <Average.h>
#include <Separador.h>
#include <ArduinoJson.h>

Separador s;

// ================== GENERALS VARIABLES ======================
String WellName = "3310";
String DateTime = "dd/mm/aaaa hh:mm";
String Diagnosis = "--";
String FillPump = "--";
String SPM = "--";
String PeakLoad = "--";
String MinLoad = "--";
String Load = "--";
String Pos = "--";
String status = "--";

const int8_t pinCC1W = 1;

float f; // adc to mV

int16_t i_start, i_end;

unsigned long start_time;
unsigned long end_time;

const int16_t chart_n_max = 300;
const int16_t read_n_max = 800;
float FillPumpList[300];
float dtFillPumpList[300];

float alpha = 0.25;
float filter_value_pos = 28.4;
float filter_value_load = 12.6;
//float load_raw_t[559] = {4.09, 4.14, 4.18, 4.22, 4.25, 4.29, 4.33, 4.37, 4.42, 4.47, 4.51, 4.57, 4.62, 4.66, 4.72, 4.76, 4.79, 4.83, 4.88, 4.92, 4.97, 5.01, 5.06, 5.12, 5.17, 5.21, 5.26, 5.3, 5.34, 5.38, 5.42, 5.46, 5.49, 5.52, 5.54, 5.55, 5.55, 5.54, 5.53, 5.52, 5.51, 5.5, 5.49, 5.47, 5.45, 5.43, 5.41, 5.39, 5.36, 5.34, 5.32, 5.3, 5.28, 5.26, 5.24, 5.23, 5.21, 5.19, 5.17, 5.16, 5.16, 5.16, 5.17, 5.18, 5.2, 5.22, 5.24, 5.26, 5.28, 5.3, 5.33, 5.35, 5.38, 5.41, 5.43, 5.45, 5.47, 5.49, 5.5, 5.5, 5.52, 5.53, 5.54, 5.55, 5.56, 5.56, 5.57, 5.57, 5.57, 5.56, 5.55, 5.53, 5.52, 5.49, 5.47, 5.44, 5.41, 5.38, 5.35, 5.32, 5.3, 5.28, 5.26, 5.25, 5.24, 5.23, 5.23, 5.22, 5.21, 5.21, 5.21, 5.21, 5.21, 5.21, 5.21, 5.22, 5.23, 5.24, 5.25, 5.26, 5.27, 5.29, 5.31, 5.33, 5.35, 5.38, 5.4, 5.42, 5.43, 5.44, 5.44, 5.44, 5.44, 5.44, 5.44, 5.44, 5.43, 5.42, 5.4, 5.39, 5.38, 5.37, 5.37, 5.37, 5.36, 5.35, 5.33, 5.31, 5.29, 5.27, 5.25, 5.22, 5.2, 5.18, 5.17, 5.16, 5.14, 5.13, 5.13, 5.13, 5.13, 5.14, 5.16, 5.18, 5.19, 5.21, 5.23, 5.25, 5.27, 5.28, 5.29, 5.31, 5.33, 5.35, 5.37, 5.38, 5.4, 5.42, 5.43, 5.45, 5.46, 5.48, 5.5, 5.51, 5.52, 5.53, 5.53, 5.53, 5.53, 5.51, 5.49, 5.48, 5.46, 5.45, 5.44, 5.43, 5.42, 5.4, 5.38, 5.37, 5.36, 5.35, 5.34, 5.34, 5.34, 5.34, 5.34, 5.33, 5.32, 5.31, 5.3, 5.31, 5.32, 5.33, 5.34, 5.36, 5.37, 5.39, 5.42, 5.45, 5.46, 5.48, 5.5, 5.52, 5.53, 5.54, 5.55, 5.56, 5.57, 5.57, 5.57, 5.57, 5.56, 5.57, 5.58, 5.58, 5.59, 5.59, 5.6, 5.6, 5.59, 5.59, 5.57, 5.57, 5.55, 5.54, 5.53, 5.53, 5.51, 5.5, 5.48, 5.47, 5.47, 5.47, 5.47, 5.47, 5.48, 5.49, 5.5, 5.51, 5.52, 5.52, 5.53, 5.53, 5.53, 5.53, 5.53, 5.53, 5.53, 5.53, 5.52, 5.5, 5.48, 5.45, 5.41, 5.36, 5.31, 5.27, 5.22, 5.17, 5.13, 5.08, 5.04, 5.01, 4.96, 4.93, 4.89, 4.86, 4.83, 4.8, 4.76, 4.73, 4.71, 4.66, 4.63, 4.6, 4.56, 4.54, 4.51, 4.48, 4.45, 4.42, 4.39, 4.36, 4.34, 4.32, 4.3, 4.28, 4.27, 4.26, 4.26, 4.26, 4.25, 4.25, 4.26, 4.25, 4.25, 4.25, 4.26, 4.26, 4.26, 4.27, 4.27, 4.28, 4.28, 4.29, 4.29, 4.3, 4.3, 4.3, 4.3, 4.3, 4.3, 4.3, 4.29, 4.29, 4.28, 4.27, 4.27, 4.26, 4.26, 4.25, 4.25, 4.25, 4.24, 4.24, 4.24, 4.24, 4.23, 4.23, 4.22, 4.21, 4.21, 4.21, 4.21, 4.21, 4.21, 4.22, 4.22, 4.23, 4.24, 4.25, 4.26, 4.28, 4.29, 4.31, 4.33, 4.35, 4.36, 4.37, 4.38, 4.39, 4.4, 4.41, 4.42, 4.42, 4.43, 4.45, 4.45, 4.46, 4.47, 4.48, 4.49, 4.5, 4.5, 4.5, 4.49, 4.48, 4.47, 4.47, 4.46, 4.46, 4.46, 4.45, 4.45, 4.44, 4.43, 4.43, 4.43, 4.43, 4.43, 4.43, 4.44, 4.45, 4.45, 4.46, 4.46, 4.47, 4.47, 4.48, 4.48, 4.49, 4.5, 4.51, 4.52, 4.53, 4.55, 4.56, 4.57, 4.58, 4.59, 4.6, 4.6, 4.62, 4.63, 4.65, 4.65, 4.66, 4.66, 4.66, 4.65, 4.64, 4.63, 4.62, 4.59, 4.56, 4.53, 4.49, 4.43, 4.37, 4.32, 4.25, 4.18, 4.1, 4.02, 3.95, 3.88, 3.82, 3.76, 3.7, 3.64, 3.59, 3.53, 3.48, 3.42, 3.36, 3.31, 3.26, 3.21, 3.16, 3.11, 3.06, 3.0, 2.96, 2.92, 2.9, 2.9, 2.89, 2.9, 2.92, 2.94, 2.96, 2.98, 3.0, 3.02, 3.04, 3.05, 3.06, 3.08, 3.1, 3.13, 3.16, 3.19, 3.22, 3.24, 3.26, 3.28, 3.3, 3.32, 3.34, 3.34, 3.36, 3.35, 3.34, 3.32, 3.29, 3.26, 3.22, 3.19, 3.17, 3.14, 3.12, 3.09, 3.08, 3.06, 3.04, 3.02, 2.99, 2.97, 2.94, 2.92, 2.91, 2.9, 2.89, 2.87, 2.87, 2.86, 2.86, 2.87, 2.88, 2.91, 2.94, 2.98, 3.01, 3.05, 3.09, 3.13, 3.17, 3.2, 3.23, 3.25, 3.26, 3.28, 3.3, 3.32, 3.35, 3.38, 3.41, 3.44, 3.46, 3.49, 3.52, 3.54, 3.56, 3.58, 3.6, 3.6, 3.59, 3.6, 3.61, 3.63, 3.65, 3.67, 3.69, 3.71, 3.73, 3.75, 3.79, 3.82};
//float pos_raw_t[559] = {0.0, 0.0, 0.01, 0.01, 0.02, 0.03, 0.05, 0.07, 0.09, 0.11, 0.13, 0.16, 0.19, 0.22, 0.26, 0.3, 0.34, 0.38, 0.43, 0.48, 0.53, 0.58, 0.64, 0.7, 0.76, 0.83, 0.89, 0.96, 1.04, 1.11, 1.19, 1.27, 1.35, 1.43, 1.52, 1.61, 1.7, 1.8, 1.89, 1.99, 2.09, 2.2, 2.3, 2.41, 2.53, 2.64, 2.75, 2.87, 2.99, 3.12, 3.24, 3.37, 3.5, 3.63, 3.76, 3.9, 4.04, 4.18, 4.32, 4.47, 4.61, 4.76, 4.91, 5.07, 5.22, 5.38, 5.54, 5.7, 5.86, 6.03, 6.19, 6.36, 6.53, 6.7, 6.88, 7.05, 7.23, 7.41, 7.59, 7.78, 7.96, 8.15, 8.33, 8.52, 8.71, 8.91, 9.1, 9.3, 9.49, 9.69, 9.89, 10.1, 10.3, 10.5, 10.7, 10.9, 11.1, 11.3, 11.5, 11.8, 12.0, 12.2, 12.4, 12.6, 12.8, 13.0, 13.3, 13.5, 13.7, 13.9, 14.2, 14.4, 14.6, 14.8, 15.1, 15.3, 15.5, 15.7, 16.0, 16.2, 16.4, 16.7, 16.9, 17.1, 17.4, 17.6, 17.8, 18.1, 18.3, 18.5, 18.8, 19.0, 19.2, 19.5, 19.7, 19.9, 20.2, 20.4, 20.6, 20.9, 21.1, 21.4, 21.6, 21.8, 22.1, 22.3, 22.5, 22.8, 23.0, 23.2, 23.5, 23.7, 23.9, 24.2, 24.4, 24.6, 24.9, 25.1, 25.3, 25.6, 25.8, 26.0, 26.3, 26.5, 26.7, 26.9, 27.2, 27.4, 27.6, 27.8, 28.1, 28.3, 28.5, 28.7, 29.0, 29.2, 29.4, 29.6, 29.8, 30.0, 30.2, 30.5, 30.7, 30.9, 31.1, 31.3, 31.5, 31.7, 31.9, 32.1, 32.3, 32.5, 32.7, 32.9, 33.1, 33.3, 33.5, 33.7, 33.9, 34.0, 34.2, 34.4, 34.6, 34.8, 34.9, 35.1, 35.3, 35.5, 35.6, 35.8, 36.0, 36.1, 36.3, 36.5, 36.6, 36.8, 36.9, 37.1, 37.2, 37.4, 37.5, 37.7, 37.8, 38.0, 38.1, 38.2, 38.4, 38.5, 38.6, 38.8, 38.9, 39.0, 39.1, 39.2, 39.4, 39.5, 39.6, 39.7, 39.8, 39.9, 40.0, 40.1, 40.2, 40.3, 40.4, 40.5, 40.6, 40.7, 40.7, 40.8, 40.9, 41.0, 41.0, 41.1, 41.2, 41.2, 41.3, 41.4, 41.4, 41.5, 41.5, 41.6, 41.6, 41.7, 41.7, 41.7, 41.8, 41.8, 41.8, 41.9, 41.9, 41.9, 41.9, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 42.0, 41.9, 41.9, 41.9, 41.9, 41.8, 41.8, 41.8, 41.7, 41.7, 41.7, 41.6, 41.6, 41.5, 41.5, 41.4, 41.4, 41.3, 41.2, 41.2, 41.1, 41.0, 41.0, 40.9, 40.8, 40.7, 40.7, 40.6, 40.5, 40.4, 40.3, 40.2, 40.1, 40.0, 39.9, 39.8, 39.7, 39.6, 39.5, 39.4, 39.2, 39.1, 39.0, 38.9, 38.8, 38.6, 38.5, 38.4, 38.2, 38.1, 38.0, 37.8, 37.7, 37.5, 37.4, 37.2, 37.1, 36.9, 36.8, 36.6, 36.5, 36.3, 36.1, 36.0, 35.8, 35.6, 35.5, 35.3, 35.1, 34.9, 34.8, 34.6, 34.4, 34.2, 34.0, 33.9, 33.7, 33.5, 33.3, 33.1, 32.9, 32.7, 32.5, 32.3, 32.1, 31.9, 31.7, 31.5, 31.3, 31.1, 30.9, 30.7, 30.5, 30.2, 30.0, 29.8, 29.6, 29.4, 29.2, 29.0, 28.7, 28.5, 28.3, 28.1, 27.8, 27.6, 27.4, 27.2, 26.9, 26.7, 26.5, 26.3, 26.0, 25.8, 25.6, 25.3, 25.1, 24.9, 24.6, 24.4, 24.2, 23.9, 23.7, 23.5, 23.2, 23.0, 22.8, 22.5, 22.3, 22.1, 21.8, 21.6, 21.4, 21.1, 20.9, 20.6, 20.4, 20.2, 19.9, 19.7, 19.5, 19.2, 19.0, 18.8, 18.5, 18.3, 18.1, 17.8, 17.6, 17.4, 17.1, 16.9, 16.7, 16.4, 16.2, 16.0, 15.7, 15.5, 15.3, 15.1, 14.8, 14.6, 14.4, 14.2, 13.9, 13.7, 13.5, 13.3, 13.0, 12.8, 12.6, 12.4, 12.2, 12.0, 11.8, 11.5, 11.3, 11.1, 10.9, 10.7, 10.5, 10.3, 10.1, 9.89, 9.69, 9.49, 9.3, 9.1, 8.91, 8.71, 8.52, 8.33, 8.15, 7.96, 7.78, 7.59, 7.41, 7.23, 7.05, 6.88, 6.7, 6.53, 6.36, 6.19, 6.03, 5.86, 5.7, 5.54, 5.38, 5.22, 5.07, 4.91, 4.76, 4.61, 4.47, 4.32, 4.18, 4.04, 3.9, 3.76, 3.63, 3.5, 3.37, 3.24, 3.12, 2.99, 2.87, 2.75, 2.64, 2.53, 2.41, 2.3, 2.2, 2.09, 1.99, 1.89, 1.8, 1.7, 1.61, 1.52, 1.43, 1.35, 1.27, 1.19, 1.11, 1.04, 0.96, 0.89, 0.83, 0.76, 0.7, 0.64, 0.58, 0.53, 0.48, 0.43, 0.38, 0.34, 0.3, 0.26, 0.22, 0.19, 0.16, 0.13, 0.11, 0.09, 0.07, 0.05, 0.03, 0.02, 0.01, 0.01, 0.0, 0.0};

float load_raw[read_n_max];
float pos_raw[read_n_max];

//float load_surf[chart_n_max];
//float pos_surf[chart_n_max];

float load_bottom[chart_n_max];
float pos_bottom[chart_n_max];
/* ************************************************************************************************************** */
/* ************************************************* FUNCTIONS ************************************************** */
/* ************************************************************************************************************** */

