jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
void mqttCallback(char *topic, byte *payload, unsigned int length);
void reconnect();
void OperationScreen(int16_t numberData, int16_t numberDataFill);

void mqttCallback(char *topic, byte *payload, unsigned int length)
{
    if (String(topic) == topicSubscribe + WellName + "/config")
    {
        TIME_TO_SLEEP = 150;
    }

    //Serial.println(String(topic));

    if (String(topic) == topicSubscribe + WellName + "/data")
    {

        DynamicJsonDocument doc(8000);

        String json = "";
        for (int i = 0; i < length; i++)
        {
            json += String((char)payload[i]);
        }

        //Serial.println(json);

        DeserializationError error = deserializeJson(doc, json);

        if (error)
        {
            delay(10);
            //Serial.print("deserializeJson() failed: ");
            //Serial.println(error.c_str());
            return;
        }


        String WellNames = doc["well"];
        WellName = WellNames;
        String DateTimes = doc["DT"];
        DateTime = DateTimes;
        String DiagnosisA = doc["diagnosis"];
        Diagnosis = DiagnosisA;
        String fillPump = doc["fillPump"];
        String dtFillPump = doc["dtFillPump"];
        

        int16_t numberDataFill = s.separa(fillPump, ',', 0).toInt();

        FillPump = s.separa(fillPump, ',', numberDataFill);

        for (uint32_t i = 0; i <= numberDataFill; i++)
        {
            FillPumpList[i] = s.separa(fillPump, ',', i + 1).toFloat();
            dtFillPumpList[i] = s.separa(dtFillPump, ',', i).toFloat();
            // Serial.println(String(FillPumpList[i]) + String(dtFillPumpList[i]));
        }

        int16_t numberData = 0;
        if(doc["status"] == "running"){
            String str_pos_bottom = doc["pos"];
            String str_load_bottom = doc["load"];
            numberData = s.separa(str_pos_bottom, ',', 0).toInt();
            String SPMs = doc["SPM"];
            SPM = SPMs;
            for (uint32_t i = 1; i <= numberData; i++)
            {
                pos_bottom[i] = s.separa(str_pos_bottom, ',', i).toFloat();
                load_bottom[i] = s.separa(str_load_bottom, ',', i).toFloat();
            }
        }

        

        OperationScreen(numberData, numberDataFill);
        lv_timer_handler();
        smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));
        delay(20000);
        digitalWrite(pinCC1W,LOW);
        gpio_hold_en(GPIO_NUM_1);

        digitalWrite(17,LOW);
        gpio_hold_en(GPIO_NUM_17);

        digitalWrite(4,LOW);
        gpio_hold_en(GPIO_NUM_4);

        digitalWrite(16,LOW);
        gpio_hold_en(GPIO_NUM_16);

        gpio_deep_sleep_hold_en();
        esp_deep_sleep_start();
    }
}

/* ******************* RECONNECT  ********************** */
void reconnect()
{
    int count = 0;
    while (!mqtt.connected())
    {
        if (mqtt.connect(mqtt_id, mqtt_user, mqtt_pass, topicPublish, 0, false, "Device conected"))
        {
            char topic1[25];
            String topicSubscribe1 = topicSubscribe + WellName + "/data";
            topicSubscribe1.toCharArray(topic1, (topicSubscribe1.length() + 1));
            mqtt.subscribe(topic1);
            // Serial.println(topicSubscribe1);

            delay(100);

            char topic2[25];
            String topicSubscribe2 = topicSubscribe + WellName + "/config";
            topicSubscribe2.toCharArray(topic2, (topicSubscribe2.length() + 1));
            mqtt.subscribe(topic2);
            // Serial.println(topicSubscribe2);
        }
        else
        {
            smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 255, .green = 0, .red = 255}}));
            if (count == 5)
            {
                ESP.restart();
            }
            delay(5000);
        }
        count++;
    }
}

/* ************************* SETUP WIFI ************************** */
void setup_wifi()
{
    WiFi.begin(ssid, password);
    delay(100);
    int count = 0;
    while (WiFi.status() != WL_CONNECTED)
    {
        //Serial.print(ssid);
        delay(5000);
        if (count == 3)
        {
            ESP.restart();
        }
        count++;
    }

    delay(2000);
}

/* ************************* ADD DATA FUNCTION FOR ACQUISITION ************************** */
static void add_data(lv_timer_t *timer)
{
    LV_UNUSED(timer);
    static uint32_t cnt = 0;

    filter_value_pos = (alpha * ADS.readADC(0) * f) + ((1 - alpha) * filter_value_pos);
    filter_value_load = (alpha * (ADS.readADC(1) - 7290)) + ((1 - alpha) * filter_value_load);
    pos_raw[cnt] = filter_value_pos;
    load_raw[cnt] = filter_value_load;
    
    if (cnt % 5 == 0)
    {
        char payloadPos[20];
        Pos = String(pos_raw[cnt],1);
        Pos.toCharArray(payloadPos, (Pos.length() + 1));
        lv_label_set_text(label_box_pos, payloadPos);

        char payloadLoad[20];
        Load = String(load_raw[cnt],1);
        Load.toCharArray(payloadLoad, (Load.length() + 1));
        lv_label_set_text(label_box_load, payloadLoad);
    }
    lv_chart_set_next_value(posChart, pos_ser, pos_raw[cnt]*10);
    lv_chart_set_next_value(loadChart, load_ser, load_raw[cnt] * 10);

    cnt++;
}

/* ************************* ACQUISITION SCREEN ************************ */
void AcquisitionScreen()
{
    // Clear screen
    lv_obj_clean(lv_scr_act());

    // Create Header
    static lv_style_t style_shadow;
    auto Header = lv_obj_create(lv_scr_act());
    lv_obj_add_style(Header, &style_shadow, 0);
    lv_obj_set_pos(Header, 1, 1);
    lv_obj_set_size(Header, 318, 30);

    // Set label to WellName
    auto WellName_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(WellName_label, 7, 5);
    lv_obj_set_style_text_color(WellName_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(WellName_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(WellName_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    char payloadWN[15];
    WellName.toCharArray(payloadWN, (WellName.length() + 1));
    lv_label_set_text(WellName_label, payloadWN);

    // Set label to DateTime
    auto DateTime_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(DateTime_label, 120, 5);
    lv_obj_set_style_text_color(DateTime_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(DateTime_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(DateTime_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    char payloadDT[20];
    DateTime.toCharArray(payloadDT, (DateTime.length() + 1));
    lv_label_set_text(DateTime_label, payloadDT);

    // ***************** Set label to message *****************
    Acquisition_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(Acquisition_label, 10, 32);
    lv_obj_set_style_text_color(Acquisition_label, lv_palette_main(LV_PALETTE_DEEP_ORANGE), LV_STATE_DEFAULT);
    lv_label_set_long_mode(Acquisition_label, LV_LABEL_LONG_SCROLL_CIRCULAR); /*Circular scroll*/
    lv_obj_set_width(Acquisition_label, 300);
    lv_obj_set_style_text_font(Acquisition_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);
    lv_label_set_text(Acquisition_label, "Acquiring data");

    // ***************** Create Load text *****************
    lv_obj_t *box_load = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_load, true);
    lv_textarea_set_password_mode(box_load, false);
    lv_obj_set_pos(box_load, 5, 100);
    lv_obj_set_size(box_load, 85, 45);

    label_box_load = lv_label_create(box_load);

    lv_obj_center(label_box_load);
    lv_obj_set_style_text_font(label_box_load, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *load_label = lv_label_create(lv_scr_act());
    lv_label_set_text(load_label, "Load:");
    lv_obj_align_to(load_label, box_load, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create chart load *****************
    loadChart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(loadChart, 95, 100);
    lv_obj_set_size(loadChart, 220, 125);
    //lv_obj_set_style_line_width(loadChart, 2, LV_PART_ITEMS);   /*Remove the lines*/
    lv_obj_set_style_size(loadChart, 2, LV_PART_INDICATOR);
    lv_chart_set_type(loadChart, LV_CHART_TYPE_LINE);
    lv_chart_set_update_mode(loadChart, LV_CHART_UPDATE_MODE_CIRCULAR);
    load_ser = lv_chart_add_series(loadChart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_range(loadChart, LV_CHART_AXIS_PRIMARY_Y, 0, 2000);
    lv_chart_set_point_count(loadChart, read_n_max);

    // ***************** Create POS text *****************
    lv_obj_t *box_pos = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_pos, true);
    lv_textarea_set_password_mode(box_pos, false);
    lv_obj_set_pos(box_pos, 5, 250);
    lv_obj_set_size(box_pos, 85, 45);

