jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
    label_box_pos = lv_label_create(box_pos);

    char payloadPos[20];
    Pos.toCharArray(payloadPos, (Pos.length() + 1));
    lv_label_set_text(label_box_pos, payloadPos);
    lv_obj_center(label_box_pos);
    lv_obj_set_style_text_font(label_box_pos, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *pos_label = lv_label_create(lv_scr_act());
    lv_label_set_text(pos_label, "Pos:");
    lv_obj_align_to(pos_label, box_pos, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create chart pos *****************
    posChart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(posChart, 95, 250);
    lv_obj_set_size(posChart, 220, 125);
    lv_obj_set_style_size(posChart, 2, LV_PART_INDICATOR);
    lv_chart_set_type(posChart, LV_CHART_TYPE_LINE); /*Show lines and points too*/
    lv_chart_set_update_mode(posChart, LV_CHART_UPDATE_MODE_CIRCULAR);
    pos_ser = lv_chart_add_series(posChart, lv_palette_main(LV_PALETTE_BLUE_GREY), LV_CHART_AXIS_PRIMARY_Y);
    lv_chart_set_range(posChart, LV_CHART_AXIS_PRIMARY_Y, 150, 400);
    lv_chart_set_point_count(posChart, read_n_max);

    lv_timer_t *timer = lv_timer_create(add_data, 2, NULL);
    lv_timer_set_repeat_count(timer, read_n_max-1);
}

/* ************************* OPERATION SCREEN ************************ */
void OperationScreen(int16_t numberData, int16_t numberDataFill)
{
    // Clear screen
    lv_obj_clean(lv_scr_act());

    // Create Header
    static lv_style_t style_shadow;
    auto Header = lv_obj_create(lv_scr_act());
    lv_obj_add_style(Header, &style_shadow, 0);
    lv_obj_set_pos(Header, 1, 1);
    lv_obj_set_size(Header, 318, 30);

    // Set label to WellName
    auto WellName_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(WellName_label, 7, 5);
    lv_obj_set_style_text_color(WellName_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(WellName_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(WellName_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    char payloadWN[15];
    WellName.toCharArray(payloadWN, (WellName.length() + 1));
    lv_label_set_text(WellName_label, payloadWN);

    // Set label to DateTime
    auto DateTime_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(DateTime_label, 120, 5);
    lv_obj_set_style_text_color(DateTime_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(DateTime_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(DateTime_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    char payloadDT[20];
    DateTime.toCharArray(payloadDT, (DateTime.length() + 1));
    lv_label_set_text(DateTime_label, payloadDT);

    // ***************** Set label to Diagnosis *****************
    auto Diagnosis_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(Diagnosis_label, 10, 32);
    lv_obj_set_style_text_color(Diagnosis_label, lv_palette_main(LV_PALETTE_DEEP_ORANGE), LV_STATE_DEFAULT);
    lv_label_set_long_mode(Diagnosis_label, LV_LABEL_LONG_SCROLL_CIRCULAR); /*Circular scroll*/
    lv_obj_set_width(Diagnosis_label, 300);
    lv_obj_set_style_text_font(Diagnosis_label, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    char payloadDignosis[100];
    Diagnosis.toCharArray(payloadDignosis, (Diagnosis.length() + 1));
    lv_label_set_text(Diagnosis_label, payloadDignosis);

    // ***************** Create dynachart *****************
    lv_obj_t *dynachart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(dynachart, 45, 65);
    lv_obj_set_size(dynachart, 180, 250);
    // lv_obj_add_event_cb(dynachart, draw_event_cb, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_set_style_line_width(dynachart, 1, LV_PART_ITEMS); /*Remove the lines*/

    lv_chart_set_type(dynachart, LV_CHART_TYPE_SCATTER);

    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_X, 10, 5, 5, 4, true, 30);
    lv_chart_set_axis_tick(dynachart, LV_CHART_AXIS_PRIMARY_Y, 10, 5, 6, 5, true, 50);

    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_X, 0, 420);
    lv_chart_set_range(dynachart, LV_CHART_AXIS_PRIMARY_Y, 0, 600);

    lv_chart_set_point_count(dynachart, numberData);

    lv_chart_series_t *ser = lv_chart_add_series(dynachart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);

    for (uint32_t i = 0; i < numberData; i++)
    {
        lv_chart_set_next_value2(dynachart, ser, pos_bottom[i] * 10, load_bottom[i] * 100);
    }

    // ***************** Create fill text *****************
    lv_obj_t *box_fill = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_fill, true);
    lv_textarea_set_password_mode(box_fill, false);
    lv_obj_set_pos(box_fill, 230, 75);
    lv_obj_set_size(box_fill, 85, 45);

    auto label_box_fill = lv_label_create(box_fill);

    char payloadFill[20];
    FillPump.toCharArray(payloadFill, (FillPump.length() + 1));
    lv_label_set_text(label_box_fill, payloadFill);
    lv_obj_center(label_box_fill);
    lv_obj_set_style_text_font(label_box_fill, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *fill_label = lv_label_create(lv_scr_act());
    lv_label_set_text(fill_label, "Fill (%):");
    lv_obj_align_to(fill_label, box_fill, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create SPM text *****************
    lv_obj_t *box_SPM = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_SPM, true);
    lv_textarea_set_password_mode(box_SPM, false);
    lv_obj_set_pos(box_SPM, 230, 150);
    lv_obj_set_size(box_SPM, 85, 45);

    auto label_box_SPM = lv_label_create(box_SPM);

    char payloadSPM[20];
    SPM.toCharArray(payloadSPM, (SPM.length() + 1));
    lv_label_set_text(label_box_SPM, payloadSPM);
    lv_obj_center(label_box_SPM);
    lv_obj_set_style_text_font(label_box_SPM, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *SPM_label = lv_label_create(lv_scr_act());
    lv_label_set_text(SPM_label, "SPM (Hz):");
    lv_obj_align_to(SPM_label, box_SPM, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

