jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
    // ***************** Create PEAK LOAD *****************
    lv_obj_t *box_peak = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_peak, true);
    lv_textarea_set_password_mode(box_peak, false);
    lv_obj_set_pos(box_peak, 230, 225);
    lv_obj_set_size(box_peak, 85, 45);

    auto label_box_peak = lv_label_create(box_peak);

    char payloadPeak[20];
    PeakLoad.toCharArray(payloadPeak, (PeakLoad.length() + 1));
    lv_label_set_text(label_box_peak, payloadPeak);
    lv_obj_center(label_box_peak);
    lv_obj_set_style_text_font(label_box_peak, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *Peak_label = lv_label_create(lv_scr_act());
    lv_label_set_text(Peak_label, "Peak (KLb):");
    lv_obj_align_to(Peak_label, box_peak, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create MIN LOAD *****************
    lv_obj_t *box_min = lv_textarea_create(lv_scr_act());
    lv_textarea_set_one_line(box_min, true);
    lv_textarea_set_password_mode(box_min, false);
    lv_obj_set_pos(box_min, 230, 300);
    lv_obj_set_size(box_min, 85, 45);

    auto label_box_min = lv_label_create(box_min);

    char payloadMin[20];
    MinLoad.toCharArray(payloadMin, (MinLoad.length() + 1));
    lv_label_set_text(label_box_min, payloadMin);
    lv_obj_center(label_box_min);
    lv_obj_set_style_text_font(label_box_min, &lv_font_montserrat_22, LV_STATE_DEFAULT);

    lv_obj_t *Min_label = lv_label_create(lv_scr_act());
    lv_label_set_text(Min_label, "Min (KLb):");
    lv_obj_align_to(Min_label, box_min, LV_ALIGN_OUT_TOP_LEFT, 0, 0);

    // ***************** Create fillpump plot *****************
    lv_obj_t *fillchart = lv_chart_create(lv_scr_act());
    lv_obj_set_pos(fillchart, 45, 370);
    lv_obj_set_size(fillchart, 270, 80);
    // lv_obj_add_event_cb(fillchart, draw_event_cb, LV_EVENT_DRAW_PART_BEGIN, NULL);
    lv_obj_set_style_line_width(fillchart, 1, LV_PART_ITEMS); /*Remove the lines*/
    lv_obj_set_style_size(fillchart, 2, LV_PART_INDICATOR);

    lv_chart_set_type(fillchart, LV_CHART_TYPE_SCATTER);
    // lv_chart_set_update_mode(fillchart,LV_CHART_UPDATE_MODE_CIRCULAR);
    // lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_Y, 0, 100);
    // lv_chart_set_point_count(fillchart, 250);

    lv_chart_set_axis_tick(fillchart, LV_CHART_AXIS_PRIMARY_X, 5, 5, 7, 5, true, 30);
    lv_chart_set_axis_tick(fillchart, LV_CHART_AXIS_PRIMARY_Y, 2, 1, 2, 2, true, 10);

    lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_X, 0, 240);
    lv_chart_set_range(fillchart, LV_CHART_AXIS_PRIMARY_Y, 0, 100);

    lv_chart_set_point_count(fillchart, 250);

    lv_chart_series_t *ser2 = lv_chart_add_series(fillchart, lv_palette_main(LV_PALETTE_BROWN), LV_CHART_AXIS_PRIMARY_Y);

    // lv_chart_set_next_value(posChart, pos_ser, pos_raw[cnt]*10);
    for (uint32_t i = 1; i < numberDataFill; i++)
    {
        lv_chart_set_next_value2(fillchart, ser2, dtFillPumpList[i] * 10, FillPumpList[i]);
    }

    // Set label tittle plot
    auto plot_label = lv_label_create(lv_scr_act());
    lv_obj_set_pos(plot_label, 10, 350);
    lv_obj_set_style_text_color(plot_label, lv_palette_main(LV_PALETTE_BROWN), LV_STATE_DEFAULT);
    lv_label_set_long_mode(plot_label, LV_LABEL_LONG_WRAP); /*Break the long lines*/
    lv_obj_set_style_text_font(plot_label, &lv_font_montserrat_14, LV_STATE_DEFAULT);
    lv_label_set_text(plot_label, "Fill pump for this day");
}

/* ********************** SEND DATA *********************** */
void sendData(String mqtt_payload)
{
    char payload[5120];
    mqtt_payload.toCharArray(payload, (mqtt_payload.length() + 1));

    mqtt.publish(topicPublish, payload);
}

/* ********************** SETUP *********************** */
void setup()
{
    //Serial.begin(115200);

    ADS.begin();
    f = ADS.toVoltage(1) * 10;
    //f = ADS.to
    ADS.setDataRate(5);

    pinMode(pinCC1W, OUTPUT);
    digitalWrite(pinCC1W, HIGH);
    delay(3000);

    smartdisplay_init();
    AcquisitionScreen();

    smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 255, .red = 0}}));

    start_time = millis();
    for (uint32_t i = 0; i < read_n_max; i++)
    {
        lv_timer_handler();
        // delay(2);
    }
    end_time = millis() - start_time;

    digitalWrite(pinCC1W, LOW);

    // ======== PROCESS DATA ========

    Average<float> rpos(read_n_max);
    Average<float> rload(read_n_max);

    float maxPos = 0;
    float minPos = 0;

    for (uint16_t i = 0; i < read_n_max - 1; i++)
    {
        rpos.push(pos_raw[i]);
        rload.push(load_raw[i]);
    }

    int max_pos_index = 0;
    int min_pos_index = 0;

    maxPos = rpos.maximum(&max_pos_index);
    minPos = rpos.minimum(&min_pos_index);

    //Serial.println(String(maxPos) + "," + String(minPos));

    setup_wifi();
    mqtt.setServer(broker, mqtt_port);
    mqtt.setCallback(mqttCallback);
    reconnect();

    // ======== DETECT PUMP STOPPED ========
    if (abs(maxPos - minPos) <= 5)
    {
        String mqtt_payload = "{\"well\":\"" + WellName + "\",\"status\":\"stopped\"}";
        //Serial.println(mqtt_payload);
        sendData(mqtt_payload);
        Diagnosis = "Stopped";
        
        lv_timer_handler();
        lv_timer_handler();
    }
    else
    {
        // ======== FILTER STROKE ========
        float value;
        int16_t i_start = 0;
        int16_t i_flag = 0;
        int16_t i_end = 0;
        float tp = 0;
        float diff;
        float range = maxPos - minPos;

        for (int16_t i = 0; i < read_n_max - 1; i++)
        {
            value = pos_raw[i];
            diff = value - minPos;
            if(diff > 0.8 * range && i_flag == 0 && i_end == 0){
                if(diff > tp){
                    tp = diff;
                    i_start = i;
                }
            }
            else if (i_start != 0 && diff < 0.2 * range && i_end == 0){
                if(diff < tp){
                    tp = diff;
                    i_flag = i;
                }
            }
            else if(i_flag != 0 && diff > 0.8 * range){
                if(diff > tp){
                    tp = diff;
                    i_end = i;
                }
            }
            else if(diff < 0.2 * range && i_end != 0){break;}
        }

        PeakLoad = String(rload.get(i_start-1), 2);
        MinLoad = String(rload.get(i_flag-1), 2);
        //SPM = String(60 * double(end_time) * 0.001 / (double(read_n_max) * double(i_end - i_start)));

        //Serial.println( String(SPM) + ", " + String(PeakLoad) + ", " + String(MinLoad));

