jhanccop/esp32-smartdisplay-demo-main/src/main.cpp
        // ======== TRACE IN  STROKE ========        
        load_ser->y_points[i_start + 1] = 1600;
        load_ser->y_points[i_end + 1] = 1600;

        pos_ser->y_points[i_start + 1] = 0;
        pos_ser->y_points[i_end + 1] = 0;

        lv_chart_refresh(loadChart);
        lv_chart_refresh(posChart);

        lv_timer_handler();
        lv_timer_handler();

        //Serial.println("markers: " + String(i_start) + "," + String(i_end) + "->" + String(min_pos_index) + "," + String(max_pos_index));

        String rawdataPos = "";
        String rawdataLoad = "";

        for (uint16_t i = i_start; i < i_end-1; i++)
        {
            rawdataPos += String(rpos.get(i), 2) + ",";
            rawdataLoad += String(rload.get(i), 2) + ",";
        }
        rawdataPos += String(rpos.get(i_end), 2);
        rawdataLoad += String(rload.get(i_end), 2);
        String mqtt_payload = "{\"well\":\"" + WellName + "\",\"status\":\"running\"" + ",\"pos\":\"" + rawdataPos + "\"" + ",\"load\":\"" + rawdataLoad + "\"}";
        sendData(mqtt_payload);
    }
    // sendData("-<-<-<-<-<-mqtt_payload");
    // OperationScreen();
    // lv_timer_handler();
    // smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 255, .green = 255, .red = 255}}));
    // delay(2000);
    // smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 0, .green = 0, .red = 0}}));

    esp_sleep_enable_timer_wakeup(TIME_TO_SLEEP * uS_TO_S_FACTOR);
}

void loop()
{
    if (!mqtt.connected())
    {
        reconnect();
    }

    mqtt.loop();
    delay(10);
    // AcquisitionScreen();

    // smartdisplay_set_led_color(lv_color32_t({.ch = {.blue = 255, .green = 255, .red = 0}}));

    // display_update();
    // lv_timer_handler();
}